newcodi-ytw/esp-component-nfc/demo-nfc/components/nfc/nxp/Platform/SDK_2.x_FRDM-K82F/devices/MK82F25615/drivers/fsl_ftfx_flash.c
        /* if protectStatusCounter == 0, then no region of the desired flash region is protected */
        if (protectStatusCounter == 0U)
        {
            *protection_state = kFLASH_ProtectionStateUnprotected;
        }
        /* if protectStatusCounter == regionCheckedCounter, then each region checked was protected */
        else if (protectStatusCounter == regionCheckedCounter)
        {
            *protection_state = kFLASH_ProtectionStateProtected;
        }
        /* if protectStatusCounter != regionCheckedCounter, then protection status is mixed
         * In other words, some regions are protected while others are unprotected */
        else
        {
            *protection_state = kFLASH_ProtectionStateMixed;
        }
    }
    else
    {
        *protection_state = kFLASH_ProtectionStateUnprotected;
    }

    return kStatus_FTFx_Success;
}

#if defined(FSL_FEATURE_FLASH_HAS_ACCESS_CONTROL) && FSL_FEATURE_FLASH_HAS_ACCESS_CONTROL
status_t FLASH_IsExecuteOnly(flash_config_t *config,
                             uint32_t start,
                             uint32_t lengthInBytes,
                             flash_xacc_state_t *access_state)
{
    status_t returnCode;
    ftfx_config_t *ftfxConfig;
    uint8_t flashIndex;

    if (access_state == NULL)
    {
        return kStatus_FTFx_InvalidArgument;
    }

    returnCode = flash_check_range_to_get_index(config, start, lengthInBytes, &flashIndex);
    if (returnCode != kStatus_FTFx_Success)
    {
        return returnCode;
    }

    ftfxConfig = &config->ftfxConfig[flashIndex];

    if (0U != (ftfxConfig->flashDesc.feature.hasXaccControl))
    {
#if defined(FSL_FEATURE_FLASH_HAS_ACCESS_CONTROL) && FSL_FEATURE_FLASH_HAS_ACCESS_CONTROL
        uint32_t executeOnlySegmentCounter = 0U;

        /* calculating end address */
        uint32_t endAddress = start + lengthInBytes;

        /* Aligning start address and end address */
        uint32_t alignedStartAddress = ALIGN_DOWN(start, ftfxConfig->flashDesc.accessSegmentMem.size);
        uint32_t alignedEndAddress = ALIGN_UP(endAddress, ftfxConfig->flashDesc.accessSegmentMem.size);

        uint32_t u32flag = 1U;
        uint32_t segmentIndex = 0U;
        uint32_t maxSupportedExecuteOnlySegmentCount =
            (alignedEndAddress - alignedStartAddress) / ftfxConfig->flashDesc.accessSegmentMem.size;

        while (start < endAddress)
        {
            uint32_t xacc = 0U;
            bool isInvalidSegmentIndex = false;

            segmentIndex = (start - ftfxConfig->flashDesc.accessSegmentMem.base) / ftfxConfig->flashDesc.accessSegmentMem.size;

            if ((0U == ftfxConfig->flashDesc.index) || (0U == ftfxConfig->flashDesc.feature.hasIndXaccReg))
            {
                /* For primary flash, The eight XACC registers allow up to 64 restricted segments of equal memory size.
                 */
                if (segmentIndex < 32U)
                {
                    xacc = *(const volatile uint32_t *)(uint32_t)&FTFx_XACCL3_REG;
                }
                else if (segmentIndex < ftfxConfig->flashDesc.accessSegmentMem.count)
                {
                    xacc = *(const volatile uint32_t *)(uint32_t)&FTFx_XACCH3_REG;
                    segmentIndex -= 32U;
                }
                else
                {
                    isInvalidSegmentIndex = true;
                }
            }
#if FTFx_DRIVER_HAS_FLASH1_SUPPORT
            else  if ((ftfxConfig->flashDesc.index == 1U) && ftfxConfig->flashDesc.feature.hasIndXaccReg)
            {
                /* For secondary flash, The two XACCS registers allow up to 16 restricted segments of equal memory size.
                 */
                if (segmentIndex < 8U)
                {
                    xacc = *(const volatile uint8_t *)&FTFx_XACCSL_REG;
                }
                else if (segmentIndex < ftfxConfig->flashDesc.accessSegmentMem.count)
                {
                    xacc = *(const volatile uint8_t *)&FTFx_XACCSH_REG;
                    segmentIndex -= 8U;
                }
                else
                {
                    isInvalidSegmentIndex = true;
                }
            }
#endif
            else
            {}

            if (isInvalidSegmentIndex)
            {
                break;
            }

            /* Determine if this address range is in a execute-only protection flash segment. */
            if (0U != ((~xacc) & (u32flag << segmentIndex)))
            {
                executeOnlySegmentCounter++;
            }

            start += ftfxConfig->flashDesc.accessSegmentMem.size;
        }

        if (executeOnlySegmentCounter < 1u)
        {
            *access_state = kFLASH_AccessStateUnLimited;
        }
        else if (executeOnlySegmentCounter < maxSupportedExecuteOnlySegmentCount)
        {
            *access_state = kFLASH_AccessStateMixed;
        }
        else
        {
            *access_state = kFLASH_AccessStateExecuteOnly;
        }
#endif /* FSL_FEATURE_FLASH_HAS_ACCESS_CONTROL */
    }
    else
    {
        *access_state = kFLASH_AccessStateUnLimited;
    }

    return kStatus_FTFx_Success;
}
#endif /* not define FSL_FEATURE_FLASH_HAS_ACCESS_CONTROL */

status_t FLASH_PflashSetProtection(flash_config_t *config, pflash_prot_status_t *protectStatus)
{
    if (config == NULL)
    {
        return kStatus_FTFx_InvalidArgument;
    }

    if (0U != (config->ftfxConfig[0].flashDesc.feature.hasProtControl))
    {
        if (config->ftfxConfig[0].flashDesc.feature.ProtRegBits >= 32U)
        {
            *kFPROTL = protectStatus->protl;
            if (protectStatus->protl != *kFPROTL)
            {
                return kStatus_FTFx_CommandFailure;
            }
        }
        if (config->ftfxConfig[0].flashDesc.feature.ProtRegBits == 64U)
        {
            *kFPROTH = protectStatus->proth;
            if (protectStatus->proth != *kFPROTH)
            {
                return kStatus_FTFx_CommandFailure;
            }
        }
    }
#if FTFx_DRIVER_HAS_FLASH1_SUPPORT
    else if (config->ftfxConfig[1].flashDesc.feature.hasProtControl && \
             config->ftfxConfig[1].flashDesc.feature.hasIndProtReg)
    {
        if (config->ftfxConfig[1].flashDesc.feature.ProtRegBits == 16U)
        {
            *kFPROTSL = protectStatus->protsl;
            if (protectStatus->protsl != *kFPROTSL)
            {
                return kStatus_FTFx_CommandFailure;
            }
            *kFPROTSH = protectStatus->protsh;
            if (protectStatus->protsh != *kFPROTSH)
            {
                return kStatus_FTFx_CommandFailure;
            }
        }
    }
#endif

    return kStatus_FTFx_Success;
}

status_t FLASH_PflashGetProtection(flash_config_t *config, pflash_prot_status_t *protectStatus)
{
    if ((config == NULL) || (protectStatus == NULL))
    {
        return kStatus_FTFx_InvalidArgument;
    }

    if (0U != (config->ftfxConfig[0].flashDesc.feature.hasProtControl))
    {
        if (config->ftfxConfig[0].flashDesc.feature.ProtRegBits >= 32U)
        {
            protectStatus->protl = *kFPROTL;
        }
        if (config->ftfxConfig[0].flashDesc.feature.ProtRegBits == 64U)
        {
            protectStatus->proth = *kFPROTH;
        }
    }
#if FTFx_DRIVER_HAS_FLASH1_SUPPORT
    else if (config->ftfxConfig[1].flashDesc.feature.hasProtControl && \
             config->ftfxConfig[1].flashDesc.feature.hasIndProtReg)
    {
        if (config->ftfxConfig[0].flashDesc.feature.ProtRegBits == 16U)
        {
            protectStatus->protsl = *kFPROTSL;
            protectStatus->protsh = *kFPROTSH;
        }
    }
#endif

    return kStatus_FTFx_Success;
}

status_t FLASH_GetProperty(flash_config_t *config, flash_property_tag_t whichProperty, uint32_t *value)
{
    if ((config == NULL) || (value == NULL))
    {
        return kStatus_FTFx_InvalidArgument;
    }

    if (whichProperty == kFLASH_PropertyPflash0SectorSize)
    {
        *value = config->ftfxConfig[0].flashDesc.sectorSize;
    }
    else if (whichProperty == kFLASH_PropertyPflash0TotalSize)
    {
        *value = config->ftfxConfig[0].flashDesc.totalSize;
    }
    else if (whichProperty == kFLASH_PropertyPflash0BlockSize)
    {
        *value = config->ftfxConfig[0].flashDesc.totalSize / config->ftfxConfig[0].flashDesc.blockCount;
    }
    else if (whichProperty == kFLASH_PropertyPflash0BlockCount)
    {
        *value = config->ftfxConfig[0].flashDesc.blockCount;
    }
    else if (whichProperty == kFLASH_PropertyPflash0BlockBaseAddr)
    {
        *value = config->ftfxConfig[0].flashDesc.blockBase;
    }
    else if (whichProperty == kFLASH_PropertyPflash0FacSupport)
    {
        *value = (uint32_t)config->ftfxConfig[0].flashDesc.feature.hasXaccControl;
    }
    else if (whichProperty == kFLASH_PropertyPflash0AccessSegmentSize)
    {
        *value = config->ftfxConfig[0].flashDesc.accessSegmentMem.size;
    }
    else if (whichProperty == kFLASH_PropertyPflash0AccessSegmentCount)
    {
        *value = config->ftfxConfig[0].flashDesc.accessSegmentMem.count;
    }
#if FTFx_DRIVER_HAS_FLASH1_SUPPORT
    else if (whichProperty == kFLASH_PropertyPflash1SectorSize)
    {
        *value = config->ftfxConfig[1].flashDesc.sectorSize;
    }
    else if (whichProperty == kFLASH_PropertyPflash1TotalSize)
    {
        *value = config->ftfxConfig[1].flashDesc.totalSize;
    }
    else if (whichProperty == kFLASH_PropertyPflash1BlockSize)
    {
        *value = config->ftfxConfig[1].flashDesc.totalSize / config->ftfxConfig[1].flashDesc.blockCount;
    }
    else if (whichProperty == kFLASH_PropertyPflash1BlockCount)
    {
        *value = config->ftfxConfig[1].flashDesc.blockCount;
    }
    else if (whichProperty == kFLASH_PropertyPflash1BlockBaseAddr)
    {
        *value = config->ftfxConfig[1].flashDesc.blockBase;
    }
    else if (whichProperty == kFLASH_PropertyPflash1FacSupport)
    {
        *value = (uint32_t)config->ftfxConfig[1].flashDesc.feature.hasXaccControl;
    }
    else if (whichProperty == kFLASH_PropertyPflash1AccessSegmentSize)
    {
        *value = config->ftfxConfig[1].flashDesc.accessSegmentMem.size;
    }
    else if (whichProperty == kFLASH_PropertyPflash1AccessSegmentCount)
    {
        *value = config->ftfxConfig[1].flashDesc.accessSegmentMem.count;
    }
#endif
    else if (whichProperty == kFLASH_PropertyFlexRamBlockBaseAddr)
    {
        *value = config->ftfxConfig[0].flexramBlockBase;
    }
    else if (whichProperty == kFLASH_PropertyFlexRamTotalSize)
    {
        *value = config->ftfxConfig[0].flexramTotalSize;
    }
    else /* catch inputs that are not recognized */
    {
        return kStatus_FTFx_UnknownProperty;
    }
    return kStatus_FTFx_Success;
}

static void flash_init_features(ftfx_config_t *config)
{
    if (config->flashDesc.index == 0U)
    {
        config->flashDesc.feature.isIndBlock = 1U;
        config->flashDesc.feature.hasIndPfsizeReg = 1U;
        config->flashDesc.feature.hasIndProtReg = 1U;
        config->flashDesc.feature.hasIndXaccReg = 1U;
    }
#if FTFx_DRIVER_HAS_FLASH1_SUPPORT
    else if (config->flashDesc.index == 1U)
    {
        config->flashDesc.feature.isIndBlock = FTFx_FLASH1_IS_INDEPENDENT_BLOCK;
        config->flashDesc.feature.hasIndPfsizeReg = config->flashDesc.feature.isIndBlock;
        config->flashDesc.feature.hasIndProtReg = FTFx_FLASH1_HAS_INT_PROT_REG;
        config->flashDesc.feature.hasIndXaccReg = FTFx_FLASH1_HAS_INT_XACC_REG;
    }
#endif

